app/views/users/index.html.erb

				<td><%= beer.number_drank %></td>
					<% beer.bars.each do |bar| %>
---
SELECT "bars".* FROM "bars" INNER JOIN "userbarbeers" ON "bars"."id" = "userbarbeers"."bar_id" WHERE "userbarbeers"."beer_id" = 1