app/views/users/show.html.erb

SELECT "bars".* FROM "bars" INNER JOIN "userbarbeers" ON "bars"."id" = "userbarbeers"."bar_id" WHERE "userbarbeers"."user_id" = 1
---
				<td><%= beer.number_drank %></td>
					<% beer.bars.each do |bar| %>