app/controllers/users_controller.rb

  def index
  	@user = User.find(1)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def create

  	@user = User.find(1)
  	@bar=Bar.new(params[:bar])
  	@beer = Beer.new(params[:beer])
  	# @beer=Beer.new(params[:beer])
  	Bar.where("name = '#{@bar.name}'").each do |bar|
  		bar.beers.each do |beer|
  			if (beer.name.to_s == @beer.name.to_s)
  				beer.number_drank = beer.number_drank.to_i + 1
  			else
  				puts beer.name
  				puts @beer.name
  				@beer.number_drank = 1
  				@beer.save
  			end
  		end
  	end


  	# if (@beer.number_drank == nil)
  	# 	@beer.number_drank =1
  	# else
  	# 	@beer.number_drank +=1
  	# end


  	@bar.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "bars".* FROM "bars" WHERE (name = 'Murphy's Law')
SELECT "beers".* FROM "beers" INNER JOIN "userbarbeers" ON "beers"."id" = "userbarbeers"."beer_id" WHERE "userbarbeers"."user_id" = 1
INSERT INTO "beers" ("bar_id", "created_at", "name", "number_drank", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["bar_id", nil], ["created_at", Thu, 06 Jun 2013 23:51:06 UTC +00:00], ["name", "scaldis"], ["number_drank", nil], ["updated_at", Thu, 06 Jun 2013 23:51:06 UTC +00:00], ["user_id", nil]]
INSERT INTO "bars" ("beer_id", "city", "created_at", "name", "state", "street", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
  	@user = User.find(1)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]

  def show
  	@user = User.find(1)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]